app/controllers/offline_modes_controller.rb

INSERT INTO "offline_modes" ("user_login_credential_id", "number_of_candidates", "number_of_maximum_voters", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_login_credential_id", 1], ["number_of_candidates", 1], ["number_of_maximum_voters", 1], ["created_at", "2020-02-06 11:24:37.571999"], ["updated_at", "2020-02-06 11:24:37.571999"]]
INSERT INTO "offline_mode_data" ("offline_mode_id", "name_of_candidate", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["offline_mode_id", 42], ["name_of_candidate", "sfd"], ["created_at", "2020-02-07 04:45:01.571506"], ["updated_at", "2020-02-07 04:45:01.571506"]]
---
    def vote

        offline_mode = OfflineMode.create(user_login_credential_id:session[:user_id],number_of_candidates:params[:number_of_candidates].to_i,number_of_maximum_voters:params[:number_of_maximum_voters].to_i).id

        for i in 1..(params[:number_of_candidates].to_i)
            @@candidates.merge!("name of candidate #{i}": params["name of candidate #{i}"])
            OfflineModeData.create(offline_mode_id:offline_mode,name_of_candidate:params["name of candidate #{i}"])