app/controllers/user_login_credentials_controller.rb

    def after_login
        #first commit
        #second
        @login = nil
        @login = UserLoginCredential.find_by(user_name:params[:user_name])
---
SELECT "user_login_credentials".* FROM "user_login_credentials" WHERE "user_login_credentials"."user_name" = ? LIMIT ?  [["user_name", "prince"], ["LIMIT", 1]]

    def welcome_sign_up
        @sign_up_data =  UserLoginCredential.new(sign_up_params)
        if @sign_up_data.save
---
INSERT INTO "user_login_credentials" ("user_name", "password", "email", "mobile_no", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_name", "dhyan"], ["password", "wewewewe"], ["email", "asa@sd.co"], ["mobile_no", 1212121221], ["created_at", "2020-02-04 11:01:09.025809"], ["updated_at", "2020-02-04 11:01:09.025809"]]