app/controllers/user_login_credentials_controller.rb

    def welcome_sign_up
        # sign_up_data =
        if UserLoginCredential.new(sign_up_params).save
---
INSERT INTO "user_login_credentials" ("user_name", "password", "email", "mobile_no", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_name", "prince"], ["password", "qwqwqwqw"], ["email", "sffsd@g.co"], ["mobile_no", 2121212121], ["created_at", "2020-02-04 09:18:25.411756"], ["updated_at", "2020-02-04 09:18:25.411756"]]